For self practice......

In [3]:
import pandas as pd
reviews = {"user_id": [1, 1, 2, 2, 2, 3, 4, 4, 4, 4],
           "movie_id": ["m1", "m2", "m1", "m3", "m4", "m1", "m2", "m3", "m5", "m6"],
           "rating": [2, 5, 4, 3, 5, 1, 4, 5, 3, 1]}
data=pd.DataFrame(reviews)
data

   user_id movie_id  rating
0        1       m1       2
1        1       m2       5
2        2       m1       4
3        2       m3       3
4        2       m4       5
5        3       m1       1
6        4       m2       4
7        4       m3       5
8        4       m5       3
9        4       m6       1

In [4]:
data.columns

Index(['user_id', 'movie_id', 'rating'], dtype='object')

In [5]:
data.info

<bound method DataFrame.info of    user_id movie_id  rating
0        1       m1       2
1        1       m2       5
2        2       m1       4
3        2       m3       3
4        2       m4       5
5        3       m1       1
6        4       m2       4
7        4       m3       5
8        4       m5       3
9        4       m6       1>

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   user_id   10 non-null     int64
 1   movie_id  10 non-null     object
 2   rating    10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [7]:
data.index

RangeIndex(start=0, stop=10, step=1)

In [8]:
data.dtypes

user_id      int64
movie_id    object
rating       int64
dtype: object

In [9]:
data.describe()

         user_id     rating
count  10.000000  10.000000
mean    2.700000   3.300000
std     1.251666   1.567021
min     1.000000   1.000000
25%     2.000000   2.250000
50%     2.500000   3.500000
75%     4.000000   4.750000
max     4.000000   5.000000

In [12]:
data.rating.describe()

count    10.000000
mean      3.300000
std       1.567021
min       1.000000
25%       2.250000
50%       3.500000
75%       4.750000
max       5.000000
Name: rating, dtype: float64

In [13]:
data.user_id.describe()

count    10.000000
mean      2.700000
std       1.251666
min       1.000000
25%       2.000000
50%       2.500000
75%       4.000000
max       4.000000
Name: user_id, dtype: float64

In [14]:
data.describe().T

         count  mean       std  min   25%  50%   75%  max
user_id   10.0   2.7  1.251666  1.0  2.00  2.5  4.00  4.0
rating    10.0   3.3  1.567021  1.0  2.25  3.5  4.75  5.0

In [15]:
data.movie_id.nunique()

6

In [16]:
data.movie_id.unique()

array(['m1', 'm2', 'm3', 'm4', 'm5', 'm6'], dtype=object)

In [17]:
data[['user_id','rating']]

   user_id  rating
0        1       2
1        1       5
2        2       4
3        2       3
4        2       5
5        3       1
6        4       4
7        4       5
8        4       3
9        4       1

In [18]:
data.groupby('movie_id').mean()['rating']

movie_id
m1    2.333333
m2    4.500000
m3    4.000000
m4    5.000000
m5    3.000000
m6    1.000000
Name: rating, dtype: float64

In [19]:
df[df['user_id']==2]

   user_id movie_id  rating
2        2       m1       4
3        2       m3       3
4        2       m4       5

In [21]:
data.shape

(10, 3)

In [24]:
data.corr()

          user_id    rating
user_id  1.000000 -0.175613
rating  -0.175613  1.000000

In [25]:
data.head()

   user_id movie_id  rating
0        1       m1       2
1        1       m2       5
2        2       m1       4
3        2       m3       3
4        2       m4       5

In [26]:
data.tail()

   user_id movie_id  rating
5        3       m1       1
6        4       m2       4
7        4       m3       5
8        4       m5       3
9        4       m6       1

In [30]:
data['rating'].value_counts()

5    3
1    2
3    2
4    2
2    1
Name: rating, dtype: int64

In [32]:
import numpy as np
a= np.array([12,45,3,2,9,1])
a.argmax()

1

In [33]:
a.argsort()

array([5, 3, 2, 4, 0, 1])

In [36]:
a.sort()
a

array([ 1,  2,  3,  9, 12, 45])